package main

import (
	"day13/Operation"
	"fmt"
	"testing"
	"time"
)

func InputTest() {
	tree := Operation.AddIndexToBtree()  //添加索引进入B+树
	input := []string{"姜泥依然不喝酒，因为她讨厌绿蚁酒，讨厌一切跟那个女人有关的东西，憎恶程度，仅次于徐凤年。", "亲爹啊，以往喝酒从不给半文钱的世子殿下转性了，一下子打赏了张五千银票。",
			"随即龙虎山尊为三大天师之一的老道焦急道：“收徒得挑吉时，今日若再不起身赶往龙虎山，可就要错过了，这对小王爷也不妥当。”",
			"徐凤年单手提刀，转头笑道：“再过 飘邈梦帖吧二十里路，你便知道。你还怕我把你带到荒郊野岭行苟且事？放心，强扭的瓜不甜，这道理我如今比谁都懂。",
			"第二十八章 大字誓杀贴", "坐在地上的老魁朝徐凤年喊道：“那娃儿，给爷爷来点酒肉！吃饱喝足了再与黄老九大战个五百回合！谁输谁去湖底呆着",
			"摘了紫檀剑匣垫屁股坐着的老黄正往嘴里放一棵小草，细细咀嚼着，学世子殿下猛翻白眼" ,"老黄干脆调转身体，背对着老魁，眼不见心不烦。",
			"天不生我李淳罡，百年剑道万古枯",
			"老道士一脸为难，环视一周见没人，这才悄悄摸进怀里，掏出一本陈旧泛黄的古籍，不舍道：“这本《乘龙剑谱》",
			"老黄并不担忧见血，大少爷那三年起先吃了没江湖经验的亏，比较狼狈，越到后来，就越奸诈了", "桃花剑圣邓太阿，白衣兵圣陈芝豹", "白衣兵圣",
			"若非如此，大柱国徐骁会放心最疼爱的儿子去游历颠簸六千里？次次命悬一线却始终保住小命",
			"你，还有你，其实说到底无冤无仇，却弄得不共戴天，杀我？行啊，姜泥，你把神符拿出来，我让你刺一刀。我倒要看看，是我身上的乌夔宝甲结实，还是你的匕首锋利",
			"老魁身影如小山，即便坐着也气焰惊人，何况还有两条锁链两柄刀，下人都躲在院中不敢靠近。老魁见到徐凤年，劈头问道：“娃娃，黄老九去跟武帝城那王老仙掰命了",
			"大草两百四十五字，一笔常有五六字", "老道士则听得心惊肉跳", "END"}
	startTime := time.Now()
	for _, v := range input {
		//fmt.Printf("fmt.Fscan: %q\r\n", input)
		if v == "END" {
			fmt.Println("用户结束输入或退出")
			break
		}
		//result := Operation.KeySearch(v)
		result := tree.Search(v)
		Operation.MyPrint(v)
		fmt.Printf("|搜索词|%s|所在文件ID|%d", v, result)
		fmt.Println("")
		Operation.MyPrint(v)
	}
	timeSpend := time.Since(startTime)
	fmt.Println("搜索操作总耗时 ： ", timeSpend)
}
func ReadFileTest() {
	Operation.AddIndexToBtree()
}

func BenchmarkInputTest(b *testing.B) {
	fmt.Println("------------------------------------------添加索引并进行搜索查询操作###开始###-----------------------------------------------------")
	for i := 0; i < b.N; i ++ {
		InputTest()
	}
	fmt.Println("------------------------------------------添加索引并进行搜索查询操作###结束###-----------------------------------------------------")
}
//添加索引的测试
func BenchmarkReadFileTest(b *testing.B) {
	fmt.Println("------------------------------------------添加索引测试###开始###-----------------------------------------------------")
	b.ResetTimer()
	for i := 0; i < b.N;  i ++ {
		ReadFileTest()
	}
	b.StopTimer()
	fmt.Println("------------------------------------------添加索引测试###结束###-----------------------------------------------------")
}
